import controller


def get_choice(param):
    if param == "1":
        print("------------------------------------------------")
        print("Создание новой заметки")
        print("------------------------------------------------")
        controller.new_note()
    elif param == "2":
        print("------------------------------------------------")
        print("Отобразить все заметки")
        print("------------------------------------------------")
        controller.show_all()
    elif param == "3":
        print("------------------------------------------------")
        print("Вывести заметки в диапазоне дат")
        print("------------------------------------------------")
        start_date = input("Введите дату начала диапазона поиска(DD-MM-YYYY): ")
        end_date = input("Введите дату окончания диапазона поиска(DD-MM-YYYY): ")
        controller.show_range(start_date, end_date)
    elif param == "4":
        print("------------------------------------------------")
        print("Редактировать заметку")
        print("------------------------------------------------")
        controller.show_all()
        controller.edit_note(input("Введите id заметки для редактирования: "))
    elif param == "5":
        print("------------------------------------------------")
        print("Удалить заметку")
        print("------------------------------------------------")
        controller.show_all()
        print("------------------------------------------------")
        controller.remove_note(input("Введите id заметки для удаления или 0 для отмены: "));
    elif param == "6":
        print("------------------------------------------------")
        print("Импортировать заметки")
        print("------------------------------------------------")
        controller.import_notes()
    elif param == "7":
        print("------------------------------------------------")
        print("Экспортировать заметки")
        print("------------------------------------------------")
        controller.export_notes();
    else:
        print("------------------------------------------------")
        print("Вы ввели некорректный вариант. Попробуйте снова")
        print("------------------------------------------------")
